/*
锤子剪刀布 (20)

时间限制 1000 ms 内存限制 32768 KB 代码长度限制 100 KB 判断程序 Standard (来自 小小)
题目描述

大家应该都会玩“锤子剪刀布”的游戏：

现给出两人的交锋记录，请统计双方的胜、平、负次数，并且给出双方分别出什么手势的胜算最大。


输入描述:

输入第1行给出正整数N（<=105），即双方交锋的次数。随后N行，每行给出一次交锋的信息，即甲、乙双方同时给出的的手势。C代表“锤子”、J代表“剪刀”、B代

表“布”，第1个字母代表甲方，第2个代表乙方，中间有1个空格。



输出描述:

输出第1、2行分别给出甲、乙的胜、平、负次数，数字间以1个空格分隔。第3行给出两个字母，分别代表甲、乙获胜次数最多的手势，中间有1个空格。如果解不唯

一，则输出按字母序最小的解。


输入例子:

10

C J

J B

C B

B B

B C

C C

C B

J B

B C

J J


输出例子:

5 3 2

2 3 5

B B
*/

//code

#include<iostream>
using namespace std;
int main()
{
    int n,i,a[6],b[6];  char x,y;
    for(i=0;i<6;i++) { a[i]=0;b[i]=0;   }
    cin>>n;
    for(i=0;i<n;i++)
    {
        cin>>x>>y;
        switch(x-y)           //通过猜拳字母的Asiic码差值，判断胜负，并在数组中储存
        {
            case 7:b[0]++;a[2]++;b[4]++;continue;
            case -7:a[0]++;b[2]++;a[4]++;continue;
            case 8:a[0]++;b[2]++;a[3]++;continue;
            case -8:b[0]++;a[2]++;b[3]++;continue;
            case -1:a[0]++;b[2]++;a[5]++;continue;
            case 1:b[0]++;a[2]++;b[5]++;continue;
            case 0:a[1]++;b[1]++;continue;
        }   }
    cout<<a[0]<<" "<<a[1]<<" "<<a[2]<<endl;
    cout<<b[0]<<" "<<b[1]<<" "<<b[2]<<endl;
    if(a[3]>a[4]&&a[3]>a[5])cout<<"J ";
    if(a[4]>=a[3]&&a[4]>a[5])cout<<"C ";
    if(a[5]>=a[3]&&a[5]>=a[4])cout<<"B ";
    if(b[3]>b[4]&&b[3]>b[5])cout<<"J";
    if(b[4]>=b[3]&&b[4]>b[5])cout<<"C";
    if(b[5]>=b[3]&&b[5]>=b[4])cout<<"B";
}

